#include <stdio.h>  
    int main () {

        int N ;

        printf( " Enter N : " ) ;
        scanf( "%d" ,&N );

        int Array[ N ] ; //
        
        for ( int i = 0 ; i < N ; i++ ) {           
            printf( " Enter Value : [%d] " , i ) ; //%d เป็น "ช่องว่าง" ที่รอให้ตัวแปรมาใส่ลงไป // i ก็คือตัวแปรที่จะถูกใส่ลงไปใน %d
            scanf( "%d" , &Array[ i ] ) ; //&Array[ i ] = ป้อนเลขที่ I
        }

///////////////////////////////////////////////////////////////

        printf( "Index: " ) ;                     
            for ( int i = 0 ; i < N ; i++ ) {           
        printf( "%2d " , i ) ; // 2 ความกว้างขั้นต่ำของช่องที่จะใช้แสดงผล                  
    }

/////////////////////////////////////////////////////

     printf( "\n" ) ;       

/////////////////////////////////////////////////////

        printf( "Array: " ) ;                     
            for ( int i = 0 ; i < N ; i++ ) {          
        int A = Array[ i ] ;                     
        int prime = 1 ;                    

        if ( A < 2 ) {                          // ถ้าตัวเลขน้อยกว่า 2
            prime = 0 ;
                                    
        } else {
            for ( int j = 2 ; j < A ; j++ ) {   // J ตัวแปรใหม่ 
                if ( A % j == 0 ) {             // หารลงตัว
                    prime = 0 ;                  // 0 = ไม่ใช่จำนวนเฉพาะ
                    break ;                      // หยุด
                }
            }
        }

/////////////////////////////////////////////////////

        if ( prime == 1 )            // 1 = จำนวนเฉพาะ
            printf( "%2d " , A ) ;   // แสดงตัวเลขจริง
        else
            printf( " # " ) ;       // ถ้าไม่ใช่ #
    } 

/////////////////////////////////////////////////////

    return 0 ;                       // จบโปรแกรม
}