#include <stdio.h>    

// ---------------- ฟังก์ชันหาค่าน้อยที่สุด ----------------
int findMin ( int arr[] , int n ) {   // รับอาเรย์ arr[] และจำนวนสมาชิก n
    int min = arr[ 0 ] ;              
    for ( int i = 1 ; i < n ; i++ ) { 
        if ( arr[ i ] < min ) {       
            min = arr[ i ] ;          
        }
    }
    return min ;                      // ส่งค่าที่น้อยที่สุดกลับไป
}

// ---------------- ฟังก์ชันหาค่ามากที่สุด ----------------
int findMax ( int arr[] , int n ) {   // รับอาเรย์ arr[] และจำนวนสมาชิก n
    int max = arr[ 0 ] ;              
    for ( int i = 1 ; i < n ; i++ ) { 
        if ( arr[ i ] > max ) {       
            max = arr[ i ] ;          
        }
    }
    return max ;                      // ส่งค่าที่มากที่สุดกลับไป
}

// ---------------- ฟังก์ชันหลัก ----------------
int main ( ) {
    int n ;                           // ตัวแปรเก็บจำนวนข้อมูล
    int arr[ 100 ] ;                  // อาเรย์เก็บค่าได้สูงสุด 100 ตัว

    printf ( "Enter number of values: " ) ; // แสดงข้อความให้ผู้ใช้กรอกจำนวนข้อมูล
    scanf ( "%d" , &n ) ;                    // รับค่า N จากผู้ใช้

    printf ( "Enter value:\n" ) ;            // แสดงข้อความให้ผู้ใช้กรอกค่า (ทั้งหมดในบรรทัดเดียว)

    // ---------- รับค่า N ตัวใส่ในอาเรย์ ----------
    for ( int i = 0 ; i < n ; i++ ) {
        scanf ( "%d" , &arr[ i ] ) ;         // รับค่าทีละตัวเก็บในอาเรย์
    }

    // ---------- แสดง Index ----------
    printf ( "Index: " ) ;           // พิมพ์คำว่า Index:
    for ( int i = 0 ; i < n ; i++ ) {
        printf ( "%d " , i ) ;       // พิมพ์หมายเลขตำแหน่ง i
    }
    printf ( "\n" ) ;                // ขึ้นบรรทัดใหม่

    // ---------- แสดง Array ----------
    printf ( "Array: " ) ;           // พิมพ์คำว่า Array:
    for ( int i = 0 ; i < n ; i++ ) {
        printf ( "%d " , arr[ i ] ) ;// พิมพ์ค่าที่เก็บในอาเรย์แต่ละตำแหน่ง
    }
    printf ( "\n\n" ) ;              // ขึ้นบรรทัดใหม่ และเว้น 1 บรรทัด

    // ---------- แสดง Min และ Max ----------
    printf ( "Min : %d\n" , findMin ( arr , n ) ) ;  // เรียกฟังก์ชันหาค่าน้อยที่สุด
    printf ( "Max : %d\n" , findMax ( arr , n ) ) ;  // เรียกฟังก์ชันหาค่ามากที่สุด

    return 0 ;                       // จบการทำงานโปรแกรม
}